[
  {
    "name": "Portfolio",
    "image_path": "images/coming_soon.png",
    "image_alt": "GIF showing the usage of the portfolio",
    "category": "Project",
    "description": "A fully featured personal portfolio website that offers a preview page of new additions and highlights, easy and dynamic adding of new blog posts and projects, a contact page and some additional features",
    "background": "<p>For a while, I've been meaning to create a personal portfolio, but due to school and work taking up quite a large chunk of my time, it kept getting pushed to the back burner. But as the semester's coming to an end, I finally felt it was about time to finish this up and actually put it to good use. The site isn't just a place to showcase my work—it's also meant to demonstrate my thought process and to serve as a public record of my progress, showing how far I've come and how far I can go.</p><br><p>While I originally created it for my personal use, I've open-sourced it and designed it in a way that lets anyone (with some minor tweaks) to take the base I've built and use it for themselves—no holds barred. If you're interested, check out the README on GitHub for instructions.</p><br><p>If you find any bugs or have suggestions for updates or changes, feel free to reach out via the contact form above!</p>",
    "features": "<ul><li>A dynamic preview system that displays new additions to the portfolio as well as highlights manually set by the developer</li><li>An array of blog posts and projects that the developer can show off, including a dedicated page for each project/post with some extra information</li><li>A contact form that is both secure and easy to use</li><li>A resume embedded into the page</li><li>Keybinds for easy site traversal (1-6)</li><li>Live GIFs that display how a project can be used</li><li>Scripts to easily update the database based on JSON data</li></ul>",
    "technologies": "<ul><li>TypeScript</li><li>React.js</li><li>Node.js/Express.js</li><li>Vite</li><li>PostgreSQL</li><li>CSS Modules</li><li>Lots of JSON</li></ul>",
    "live": "/",
    "source": "https://github.com/danielpodgornyy/portfolio",
    "created": "5/2/2025"
  },
  {
    "name": "Project Atlas",
    "image_path": "images/coming_soon.png",
    "image_alt": "GIF showing the globe and how its used",
    "category": "Project",
    "description": "A website that displays an interactable 3D render of a globe with filters that display a plethora of live data",
    "background": "<p>For my capstone course during the spring semester of 2025, we were tasked with selecting from a list of options that would determine the project we’d be working on for the next two semesters. After reviewing the available options, nothing really clicked with me, since I wanted a project that could really stretch my thinking and allow me to show off the depth of my skill set. Thus, after brainstorming with my team, we decided to select a web application that would display the cheapest flights based on the user's destination and departure location. While on the surface it's a very basic idea for a project, the main reason we chose it is because we felt that if we were able to build upon it and transition its purpose to a more informative and educational tool (using the change request forms built into the class environment), then we'd be able to create a more meaningful and interesting product that has a higher feature ceiling.</p><br/><p>The project is a web application displaying a 3D render of a globe that's meant to serve as a fun way for users to learn more about other parts of the world. This is done via two key features. First, we have a news side panel that describes major events currently occurring either around the world (if no country is selected) or within a country (if that country is selected). The second key feature is the list of filters that allow the user to switch between filters displaying a wide array of information, including: weather patterns, live flight positions, demographic data (not yet implemented), etc. Each of these filters will have its own array of features and interactivity that will facilitate the learning process.</p><br/><p>The current iteration of the project is only a prototype. The final product will be completed at the end of the fall semester of 2025.</p>",
    "features": "<ul><li>A 3D render of an interactable representation of the earth</li><li>Selectable countries that help other informative features to specify events and information about the specific selected country</li><li>A search bar that allows for an easier selection of countries</li><li>A news panel that will display events occuring in the world</li><li>A filters panel that allow the user to switch between filters that map global data onto the 3D render</li><ul><li>Live flight positions</li><li>Global weather patterns</li><li>Many more to come ...</li></ul><li>An additional information pannel to describe information linked between the filter and the selected country (TBC)</li>",
    "technologies": "<ul><li>Three.js / React Three Fiber</li><li>Vanilla JavaScript</li><li>React.js</li><li>Django REST Framework</li><li>GeoJSON</li><li>A variety of APIs, including</li><ul><li><a href=\"https://opensky-network.org/\">OpenSky Network</a></li></li><li>Add the rest of the APIs after cleaning up project</li></ul>",
    "live": "",
    "source": "https://github.com/CSCE-4901-Capstone/project-atlas",
    "created": "4/28/2025"
  },
  {
    "name": "C Code Analysis Tool",
    "image_path": "gifs/c_code_analysis_tool.gif",
    "image_alt": "GIF showing how to use the code analysis tool",
    "category": "Project",
    "description": "A code analysis tool, implemented as a website, that parses either a github repo or .zip folder and grades each file based on a set of criteria and standards",
    "background": "<p>This tool was created to slightly emulate a tool I used during my internship at Apex Capital. It came to my mind when I was tasked with creating a project that implements some sort of testing/testing adjacent tool and I thought to myself that creating a static code analysis tool that acted similarly to <a href=\"https://codescene.com/\">CodeScene</a> would be a good learning experience in trying to figure out how to implement it.</p><br/><p>After doing some research I felt it was best to prioritise a static parsing method specifically only for C code that would grade only functions within each file based on whether or not they performed well against a set of criteria made up of <a href=\"https://en.wikipedia.org/wiki/Code_smell\"><i>code smells</i></a>. Keeping the project within this scope allowed me to avoid any sort of scope creep I might've run into since I knew I already had limited time to focus on its implementation</p><br/><p>While I currently don't have any plans to build upon it, I might revist it in the future to make it more robust, add more criteria and add more dynamic features (like with machine learning).</p>",
    "features": "<ul><li>Can parse files either via a zip file or a GitHub repo link</li><li>The graded project is displayed to the user via a grid of grades given to each file</li><li>A page displaying each functions error within a specific file and the code of the function that caused said error</li>",
    "technologies": "<ul><li>Angular.js</li><li>TypeScript</li><li>Flask</li><li>SASS (I personally didn't work with this alot)</li><li>Pytest</li>",
    "live": "",
    "source": "https://github.com/danielpodgornyy/code-analysis-tool",
    "created": "04/24/2025"
  },
  {
    "name": "Netman",
    "image_path": "gifs/netman.gif",
    "image_alt": "GIF showing how to use the multi-chat application portion of netman",
    "category": "Project",
    "description": "A python application meant to show off an array networking concepts through a collection of mini-to-medium sized projects. There is currently only one project implemented: the multiroom chat application",
    "background": "<p>This project was created after I had some free time on hand for the winter break of 2025. I really wanted some kind of project to work on, and since I'd just completed a computer networking course, it was fitting to do a project that would apply a lot of the ideas I've learned throughout the semester.</p><br/><p>The project was originally meant to be a collection of sub-projects that would apply a lot more of what I learned throughout. However for now, just the chat application has been completed.</p>",
    "features": "<ul><li>A live chat application that automatically updates without refreshing</li><ul><li>Direct connections to servers via input IP addresses</li><li>Chat room creation that would allow a user to switch between created rooms</li><li>Chat logs are non-persistent</li></ul>",
    "technologies": "<ul><li>Vanilla python using sockets and threads</li><li>Tkinter (UI)</li>",
    "live": "",
    "source": "https://github.com/danielpodgornyy/netman",
    "created": "01/03/2025"
  }
]
